# TrussLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussLength Property
ParameterTypeId Class See Also
---
"Truss Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace